<a href="https://colab.research.google.com/github/vgaby23/Shopee-Code-League/blob/master/Shopee_Code_League_Order_Brushing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv("/content/order_brush_order.csv")
df.head
df['event_time'] = pd.to_datetime(df['event_time'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222750 entries, 0 to 222749
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   orderid     222750 non-null  int64
 1   shopid      222750 non-null  int64
 2   userid      222750 non-null  int64
 3   event_time  222750 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(3)
memory usage: 6.8 MB

In [ ]:
#df['duration'] = df['event_time'].time_column.astype(int)
df = df.groupby(['shopid','userid']).agg(
    min_event_time = ('event_time', 'min'),
    max_event_time = ('event_time', 'max'),
    order_id = ('orderid', 'count'))
df['duration_minute'] = df['max_event_time'] - df['min_event_time']
df.head()

                      min_event_time  ... duration_minute
shopid userid                         ...
10009  196962305 2019-12-27 03:06:50  ...          0 days
10051  2854032   2019-12-27 19:16:11  ...          0 days
       48600461  2019-12-29 01:56:19  ...          0 days
10061  62464559  2019-12-31 02:58:48  ...          0 days
       130633421 2019-12-30 21:35:15  ...          0 days

[5 rows x 4 columns]

In [ ]:
df.reset_index(level=-1, inplace=True)
df.reset_index(level=-1, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205003 entries, 0 to 205002
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   shopid           205003 non-null  int64
 1   userid           205003 non-null  int64
 2   min_event_time   205003 non-null  datetime64[ns]
 3   max_event_time   205003 non-null  datetime64[ns]
 4   order_id         205003 non-null  int64
 5   duration_minute  205003 non-null  timedelta64[ns]
dtypes: datetime64[ns](2), int64(3), timedelta64[ns](1)
memory usage: 9.4 MB

In [ ]:
df_agg = df[df['order_id'] >= 3]
df_agg.head()

     shopid     userid  ... order_id duration_minute
379   10159   62775725  ...        3 2 days 00:29:44
426   10159  214988798  ...        3 0 days 00:18:34
509   10208   11288307  ...        3 1 days 16:34:06
822   10287   74488711  ...        3 4 days 00:48:46
856   10287  103289694  ...        3 0 days 02:10:26

[5 rows x 6 columns]

In [ ]:
df_agg.duration_minute.astype('timedelta64[m]')
df_agg.head()

     shopid     userid  ... order_id duration_minute
379   10159   62775725  ...        3          2909.0
426   10159  214988798  ...        3            18.0
509   10208   11288307  ...        3          2434.0
822   10287   74488711  ...        3          5808.0
856   10287  103289694  ...        3           130.0

[5 rows x 6 columns]

In [ ]:
df_agg = df_agg[df_agg.duration_minute <= 60 ]
df_agg.info()
df_agg.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 563 entries, 426 to 204901
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   shopid           563 non-null    int64
 1   userid           563 non-null    int64
 2   min_event_time   563 non-null    datetime64[ns]
 3   max_event_time   563 non-null    datetime64[ns]
 4   order_id         563 non-null    int64
 5   duration_minute  563 non-null    float64
dtypes: datetime64[ns](2), float64(1), int64(3)
memory usage: 30.8 KB

      shopid     userid  ... order_id duration_minute
426    10159  214988798  ...        3            18.0
901    10287  198097381  ...        3             4.0
907    10287  214226569  ...        3            13.0
1108   10402      77819  ...        3             5.0
1847   29583  214495220  ...        4            15.0

[5 rows x 6 columns]

In [ ]:
df_agg.userid = df_agg.userid.astype('str')
df_agg = df_agg.groupby(by = "shopid", as_index = False).agg({'userid' :', '.join})
df_agg.head()

   shopid                userid
0   10159             214988798
1   10287  198097381, 214226569
2   10402                 77819
3   29583  214495220, 215275495
4   42472                740844